Tekla Open API Reference for Tekla Structures 2025
DimensionSetBaseAttributes.CombinedDimensionAttributes.Format Property
 The combined dimension format.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DimensionSetBaseAttributes.CombineFormats Format { get; set; }
Public Property Format As DimensionSetBaseAttributes.CombineFormats
	Get
	Set
Property Value
Type: DimensionSetBaseAttributes.CombineFormats
See Also
Reference
DimensionSetBaseAttributes.CombinedDimensionAttributes Class
Tekla.Structures.Drawing Namespace